alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
    int lineH  = largeFont ? 18 : 10;   // Font2: 16px+2gap  GLCD: 8px+2gap
    int maxVis = histH / lineH;

    // scrollOffset=0 means show bottom of history
    int firstIdx = lineCount - maxVis - scrollOffset;
    if (firstIdx < 0) firstIdx = 0;

    if (largeFont) tft.setTextFont(2); else tft.setTextSize(1);
    tft.setTextWrap(false);  // prevent overflow wrapping onto adjacent lines
    for (int i = 0; i < maxVis && (firstIdx + i) < lineCount; i++) {
        int idx = firstIdx + i;
        tft.setTextColor(lineColor[idx], COL_BG);
        tft.setCursor(0, i * lineH);
        tft.print(lines[idx]);
    }
    tft.setTextWrap(true);
    tft.setTextFont(1);  // restore GLCD for everything else
}

void addMessage(bool isUser, bool isError, const char* text) {
    if (historyCount >= MAX_MESSAGES) {
        // Drop oldest two (user+AI pair)
        memmove(history, history + 2, (MAX_MESSAGES - 2) * sizeof(Message));
        historyCount -= 2;
    }
    history[historyCount].isUser  = isUser;
    history[historyCount].isError = isError;
    strncpy(history[historyCount].text, text, 2047);
    history[historyCount].text[2047] = '\0';
    historyCount++;
    scrollOffset = 0;   // auto-scroll to bottom
    rebuildLines();
    drawHistory();
}

// --- Touch coordinate mapping ---
// Raw XPT2046 range ~200–3900 → screen pixels
void mapTouch(TS_Point& tp, int& sx, int& sy) {
    sx = map(tp.x, 200, 3900, 0, SCREEN_W - 1);
    sy = map(tp.y, 200, 3900, 0, SCREEN_H - 1);
}

// --- Debounce ---
unsigned long lastTouchMs = 0;
#define TOUCH_DEBOUNCE_MS 250
#define SWIPE_THRESHOLD    15   // screen px of drag to register a scroll step

// --- Key hit-test helpers ---
bool inRect(int sx, int sy, int rx, int ry, int rw, int rh) {
    return sx >= rx && sx < rx + rw && sy >= ry && sy < ry + rh;
}

// Hit-test keyboard rows 0–3; flashes the key 100ms for feedback; returns string to append
String typeKBKey(int sx, int sy) {
    if (sy < KB_Y) return "";
    int rowStep = KEY_H + KEY_GAP;
    int rowIdx  = (sy - KB_Y) / rowStep;
    int rowY    = KB_Y + rowIdx * rowStep;
    if (sy >= rowY + KEY_H) return "";  // landed in gap between rows

    int    kx  = -1, x;
    String typed;
    char   lbl[3] = {0};  // ASCII display label for flash (max 2 chars)

    switch (rowIdx) {
        case 0: {  // number / symbol / alt row
            x = KB_ROW3_X;
            for (int i = 0; i < 10; i++, x += KEY_W + KEY_GAP) {
                if (inRect(sx, sy, x, rowY, KEY_W, KEY_H)) {
                    if (altOn) {
                        typed = KB_NUM_ALT_TYPED[i];
                        strncpy(lbl, KB_NUM_ALT_DISP[i], 2); lbl[2] = '\0';
                    } else {
                        const char* nums = shiftOn ? KB_NUM_SHIFTED : KB_NUM_UNSHIFTED;
                        typed = String(nums[i]);
                        lbl[0] = nums[i]; lbl[1] = '\0';
                    }
                    kx = x; break;
                }
            }
            break;
        }
        case 1: {  // QWERTY
            x = KB_ROW1_X;
            for (int i = 0; i < 10; i++, x += KEY_W + KEY_GAP) {
                if (inRect(sx, sy, x, rowY, KEY_W, KEY_H)) {
                    char c = shiftOn ? KB_ROW1[i] : (KB_ROW1[i] + 32);
                    typed = String(c); lbl[0] = c; lbl[1] = '\0'; kx = x; break;
                }
            }
            break;
        }
        case 2: {  // ASDFGHJKL (BS handled in handleTouch)
            x = KB_ROW2_X;
            for (int i = 0; i < 9; i++, x += KEY_W + KEY_GAP) {
                if (inRect(sx, sy, x, rowY, KEY_W, KEY_H)) {
                    char c = shiftOn ? KB_ROW2[i] : (KB_ROW2[i] + 32);
                    typed = String(c); lbl[0] = c; lbl[1] = '\0'; kx = x; break;
                }
            }
            break;
        }
        case 3: {  // ZXCVBNM + ,./  (shifted: <>?  alt: [\])
            x = KB_ROW3_X;
            for (int i = 0; i < 7; i++, x += KEY_W + KEY_GAP) {
                if (inRect(sx, sy, x, rowY, KEY_W, KEY_H)) {
                    char c = shiftOn ? KB_ROW3[i] : (KB_ROW3[i] + 32);
                    typed = String(c); lbl[0] = c; lbl[1] = '\0'; kx = x; break;
                }
            }
            if (typed.length() == 0) {
                const char unshifted[] = { ',', '.', '/' };
                const char shifted[]   = { '<', '>', '?' };
                const char alt_ext[]   = { '[', ']', '\\' };
                const char* extras = altOn ? alt_ext : (shiftOn ? shifted : unshifted);
                for (int i = 0; i < 3; i++, x += KEY_W + KEY_GAP) {
                    if (inRect(sx, sy, x, rowY, KEY_W, KEY_H)) {
                        typed = String(extras[i]); lbl[0] = extras[i]; lbl[1] = '\0'; kx = x; break;
                    }
                }
            }
            break;
        }
        // case 4: Shift/Alt/Space/Hide/CLR — handled in handleTouch()
    }

    if (kx >= 0 && typed.length() > 0) {
        drawKey(kx, rowY, KEY_W, KEY_H, lbl, TFT_WHITE, COL_BG);
        delay(100);
        drawKey(kx, rowY, KEY_W, KEY_H, lbl, COL_KEY_FACE, COL_KEY_LABEL);
    }
    return typed;
}

void sendPrompt();  // forward declaration — defined after callGemini()

void handleTouch() {
    if (!ts.touched()) return;
    if (millis() - lastTouchMs < TOUCH_DEBOUNCE_MS) {
        while (ts.touched()) delay(10);
        return;
    }

    // Sample start position; track through release to get end position for swipe
    TS_Point startPt = ts.getPoint();
    TS_Point endPt   = startPt;
    while (ts.touched()) {
        endPt = ts.getPoint();
        delay(5);
    }
    lastTouchMs = millis();

    int sx, sy;
    mapTouch(startPt, sx, sy);
    if (sx < 0 || sy < 0 || sx >= SCREEN_W || sy >= SCREEN_H) return;

    // --- History area: swipe up/down to scroll ---
    int histH = kbVisible ? HIST_H_KB_SHOW : HIST_H_KB_HIDE;
    if (sy < histH) {
        int ex, ey;
        mapTouch(endPt, ex, ey);
        int deltaY = ey - sy;
        if (abs(deltaY) >= SWIPE_THRESHOLD) {
            int steps     = max(1, abs(deltaY) / 10);
            int lineH     = largeFont ? 18 : 10;
            int maxVis    = histH / lineH;
            int maxScroll = max(0, lineCount - maxVis);
            if (deltaY > 0) {   // swipe down → older
                scrollOffset = min(scrollOffset + steps, maxScroll);
            } else {            // swipe up → newer
                scrollOffset = max(0, scrollOffset - steps);
            }
            drawHistory();
        }
        return;
    }

