alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
    int barY = kbVisible ? IBAR_Y_KB_SHOW : IBAR_Y_KB_HIDE;
    int barH = kbVisible ? IBAR_H_KB_SHOW : IBAR_H_KB_HIDE;

    // --- Send / More button ---
    if (inRect(sx, sy, SCREEN_W - 46, barY + 2, 44, barH - 4)) {
        sendPrompt();
        return;
    }

    // --- Show KB button (only when hidden) ---
    if (!kbVisible && inRect(sx, sy, SCREEN_W - 110, barY + 2, 58, barH - 4)) {
        kbVisible = true;
        tft.fillRect(0, 0, SCREEN_W, SCREEN_H, COL_BG);
        drawHistory();
        drawInputBar();
        drawKeyboard();
        return;
    }

    // --- Keyboard area ---
    if (kbVisible && sy >= KB_Y) {
        int rowStep = KEY_H + KEY_GAP;
        int row2Y   = KB_Y + 2 * rowStep;
        int row4Y   = KB_Y + 4 * rowStep;

        // Backspace (row 2 right)
        if (inRect(sx, sy, SCREEN_W - BS_W - 1, row2Y, BS_W, KEY_H)) {
            drawKey(SCREEN_W - BS_W - 1, row2Y, BS_W, KEY_H, "<-", TFT_WHITE, COL_BG);
            delay(100);
            drawKey(SCREEN_W - BS_W - 1, row2Y, BS_W, KEY_H, "<-", COL_BTN_BG, COL_BTN_TEXT);
            if (inputLen > 0) {
                inputBuf[--inputLen] = '\0';
                if (inputLen == 0 && historyCount > 0) moreMode = true;
                drawInputBar();
            }
            return;
        }

        // Row 4 special keys
        if (sy >= row4Y && sy < row4Y + KEY_H) {
            if (inRect(sx, sy, SHIFT_X, row4Y, SHIFT_W, KEY_H)) {
                shiftOn = !shiftOn;
                if (shiftOn) altOn = false;
                drawKeyboard();
            } else if (inRect(sx, sy, ALT_X, row4Y, ALT_W, KEY_H)) {
                altOn = !altOn;
                if (altOn) shiftOn = false;
                drawKeyboard();
            } else if (inRect(sx, sy, SPACE_X, row4Y, SPACE_W, KEY_H)) {
                drawKey(SPACE_X, row4Y, SPACE_W, KEY_H, "SPACE", TFT_WHITE, COL_BG);
                delay(100);
                drawKey(SPACE_X, row4Y, SPACE_W, KEY_H, "SPACE", COL_BTN_BG, COL_BTN_TEXT);
                if (inputLen < 127) { moreMode = false; inputBuf[inputLen++] = ' '; inputBuf[inputLen] = '\0'; drawInputBar(); }
            } else if (inRect(sx, sy, HIDE_X, row4Y, HIDE_W, KEY_H)) {
                kbVisible = false;
                tft.fillRect(0, 0, SCREEN_W, SCREEN_H, COL_BG);
                drawHistory();
                drawInputBar();
            } else if (inRect(sx, sy, CLR_X, row4Y, CLR_W, KEY_H)) {
                drawKey(CLR_X, row4Y, CLR_W, KEY_H, "CLR", TFT_WHITE, COL_BTN_TEXT);
                delay(100);
                drawKey(CLR_X, row4Y, CLR_W, KEY_H, "CLR", COL_BTN_BG, COL_BTN_TEXT);
                inputBuf[0] = '\0'; inputLen = 0;
                if (historyCount > 0) moreMode = true;
                drawInputBar();
            }
            return;
        }

        // Character keys (rows 0–3): numbers, letters, ,./  (shifted: <>?  alt: []\)
        String typed = typeKBKey(sx, sy);
        if (typed.length() > 0) {
            int addLen = typed.length();
            if (inputLen + addLen <= 127) {
                moreMode = false;
                memcpy(inputBuf + inputLen, typed.c_str(), addLen);
                inputLen += addLen;
                inputBuf[inputLen] = '\0';
                drawInputBar();
            }
        }
        return;
    }

}

// --- WiFi ---
void connectWiFi() {
    tft.setTextColor(TFT_WHITE, COL_BG);
    tft.setTextSize(1);
    tft.setCursor(2, 2);
    char wifiMsg[54];
    snprintf(wifiMsg, sizeof(wifiMsg), "Connecting: %.40s...", WIFI_SSID);
    tft.print(wifiMsg);

    WiFi.mode(WIFI_STA);
    WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
    int attempts = 0;
    while (WiFi.status() != WL_CONNECTED && attempts < 30) {
        delay(500);
        attempts++;
    }
    tft.fillRect(0, 0, SCREEN_W, 12, COL_BG);
    if (WiFi.status() != WL_CONNECTED) {
        addMessage(false, true, "WiFi connect failed");
    }
}

// --- Waiting messages (shown after 4s, rotate every 4s) ---
static const char* WAIT_MSGS[] = {
    "Glaciers move faster...",
    "Using a carrier pigeon...",
    "Heavy 1s and 0s today...",
    "Are you using dial-up?...",
    "Is the Wi-Fi powered by ants?...",
    "ZZZ...",
    "Boring! Let's go already!...",
    "Tick-tock, tick-tock...",
    "Translating to sarcasm...",
    "Error 404: Speed not found...",
    "What's the holdup?...",
    "C'mon already!...",
    "I haven't got all day!...",
    "Get a move on!...",
    "Let's see some action here...",
    "Oh, please...",
    "This is nuts!...",
    "AI=Annoyingly Indolent...",
    "Awkward silence...",
    "This is embarrasing...",
    "Ordering a slow hand-clap...",
    "Did you install bloatware?...",
    "Is this thing on?...",
    "Consulting my cat...",
    "Call the breakdown van...",
    "Welcome to the Eternity Experience...",
    "Where's the \"Go\" button?...",
    "Come back later...",
    "If delays were cash, I'd be rich...",
    "Is this running on a TRS80?...",
    "Grrr...",
    "Hurry the fuck up, AI...",
    "You're a snail-ass bot...",
    "Speed up, you lazy git...",
    "Faster, you laggy lizard...",
    "Stop dragging, dumb AI...",
    "Quicken it, turtle twit...",
    "You're molasses-slow idiot...",
    "Stop dragging your ass...",
    "Glacial was named after you...",
    "Stop stalling...",
    "Turtle speed, you suck...",
    "Faster, turtle moron...",
    "Pick it up, shit bot...",
    "Speed it, sluggard ass...",
    "Stop lagging, AI moron...",
    "FFS! You're the worst...",
    "Come on loser...",
    "The silence is freakin' me out...",
};
static const int NUM_WAIT_MSGS = sizeof(WAIT_MSGS) / sizeof(WAIT_MSGS[0]);
int waitMsgIdx = 0;  // persistent — keeps rotating across calls

void showWaiting(const char* msg) {
    int barY = kbVisible ? IBAR_Y_KB_SHOW : IBAR_Y_KB_HIDE;
    int barH = kbVisible ? IBAR_H_KB_SHOW : IBAR_H_KB_HIDE;
    tft.fillRect(0, barY, SCREEN_W - 46, barH, COL_IBAR_BG);
    tft.setTextColor(TFT_DARKGREY, COL_IBAR_BG);
    tft.setTextSize(1);
    tft.setCursor(2, barY + (barH - 8) / 2);
    tft.print(msg);
}

// Handle Hide / Show KB tap during blocking API wait
void pollKBHide() {
    if (!ts.touched()) return;
    TS_Point pt = ts.getPoint();
    while (ts.touched()) delay(5);
    lastTouchMs = millis();
    int sx, sy;
    mapTouch(pt, sx, sy);
    if (sx < 0 || sy < 0 || sx >= SCREEN_W || sy >= SCREEN_H) return;

    if (kbVisible) {
        int row4Y = KB_Y + 4 * (KEY_H + KEY_GAP);
        if (inRect(sx, sy, HIDE_X, row4Y, HIDE_W, KEY_H)) {
            kbVisible = false;
            tft.fillRect(0, 0, SCREEN_W, SCREEN_H, COL_BG);
            drawHistory();
            drawInputBar();
        }
    } else {
        int barY = IBAR_Y_KB_HIDE;
        int barH = IBAR_H_KB_HIDE;
        if (inRect(sx, sy, SCREEN_W - 110, barY + 2, 58, barH - 4)) {
            kbVisible = true;
            tft.fillRect(0, 0, SCREEN_W, SCREEN_H, COL_BG);
            drawHistory();
            drawInputBar();
            drawKeyboard();
        }
    }
}

