alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
// --- Gemini API call ---
String callGemini(const char* prompt) {
    // Build JSON body
    JsonDocument reqDoc;
    JsonObject sysInstr = reqDoc["system_instruction"].to<JsonObject>();
    JsonArray  sysParts = sysInstr["parts"].to<JsonArray>();
    JsonObject sysPart  = sysParts.add<JsonObject>();
    sysPart["text"]     = "Respond in 150 words or fewer. Plain text only: no markdown, no ** or * emphasis, no tables, no bullet symbols.";

    JsonArray contents = reqDoc["contents"].to<JsonArray>();

    // Add conversation history (exclude the final entry — that IS the current prompt,
    // already appended to history[] by addMessage() in sendPrompt before this call)
    for (int i = 0; i < historyCount - 1; i++) {
        JsonObject msg  = contents.add<JsonObject>();
        msg["role"]     = history[i].isUser ? "user" : "model";
        JsonArray parts = msg["parts"].to<JsonArray>();
        JsonObject part = parts.add<JsonObject>();
        part["text"]    = history[i].text;
    }

    // Add current prompt (sent once only)
    JsonObject curMsg  = contents.add<JsonObject>();
    curMsg["role"]     = "user";
    JsonArray curParts = curMsg["parts"].to<JsonArray>();
    JsonObject curPart = curParts.add<JsonObject>();
    curPart["text"]    = prompt;

    String body;
    serializeJson(reqDoc, body);

    // Build URL path with API key
    char path[256];
    snprintf(path, sizeof(path),
        "/v1beta/models/%s:generateContent?key=%s",
        GEMINI_MODEL, GEMINI_API_KEY);

    // Reconnect WiFi if dropped
    if (WiFi.status() != WL_CONNECTED) {
        connectWiFi();
        if (WiFi.status() != WL_CONNECTED) return "ERR: WiFi not connected";
    }

    WiFiClientSecure client;
    client.setInsecure();
    client.setTimeout(45);   // 45s TLS timeout (pro model needs longer)

    if (!client.connect("generativelanguage.googleapis.com", 443)) {
        return "ERR: connect failed (check WiFi/DNS)";
    }

    client.printf(
        "POST %s HTTP/1.0\r\n"
        "Host: generativelanguage.googleapis.com\r\n"
        "Content-Type: application/json\r\n"
        "Content-Length: %d\r\n\r\n",
        path, (int)body.length());
    client.print(body);

    // Read full response — drain available() buffer even after SSL close_notify
    // marks connection closed (readString() stops too early in that case)
    String fullResp = "";
    unsigned long deadline   = millis() + 45000;
    unsigned long nextMsgMs  = millis() + 4000;  // first message swap after 4s
    while (millis() < deadline) {
        while (client.available()) {
            fullResp += (char)client.read();
        }
        if (!client.connected() && !client.available()) break;
        if (millis() >= nextMsgMs) {
            showWaiting(WAIT_MSGS[waitMsgIdx]);
            waitMsgIdx = (waitMsgIdx + 1) % NUM_WAIT_MSGS;
            nextMsgMs += 4000;
        }
        pollKBHide();
        delay(10);
    }
    client.stop();
    Serial.printf("[Gemini] response len=%d\n", fullResp.length());

    if (fullResp.length() == 0) return "ERR: empty response";

    // Locate JSON body — starts at first '{'
    int jsonStart = fullResp.indexOf('{');
    if (jsonStart < 0) return "ERR: no JSON in response";
    String respBody = fullResp.substring(jsonStart);

    // Parse JSON — success if candidates present, error if error.message present
    JsonDocument respDoc;
    if (deserializeJson(respDoc, respBody) != DeserializationError::Ok) {
        Serial.println("Bad JSON: " + respBody.substring(0, 200));
        return "ERR: JSON parse failed";
    }

    // Check for API error
    const char* errMsg = respDoc["error"]["message"];
    if (errMsg) {
        char buf[80];
        snprintf(buf, sizeof(buf), "ERR: %.72s", errMsg);
        return String(buf);
    }

    const char* text = respDoc["candidates"][0]["content"]["parts"][0]["text"];
    if (!text) return "ERR: no text in response";

    return String(text);
}

// --- Send flow ---
void showThinking() {
    int barY = kbVisible ? IBAR_Y_KB_SHOW : IBAR_Y_KB_HIDE;
    int barH = kbVisible ? IBAR_H_KB_SHOW : IBAR_H_KB_HIDE;
    tft.fillRect(0, barY, SCREEN_W - 46, barH, COL_IBAR_BG);
    tft.setTextColor(TFT_DARKGREY, COL_IBAR_BG);
    tft.setTextSize(1);
    tft.setCursor(2, barY + (barH - 8) / 2);
    tft.print("Thinking...");
}

void sendPrompt() {
    char prompt[128];
    if (inputLen == 0) {
        if (!moreMode) return;  // nothing typed and no AI reply yet — ignore tap
        strncpy(prompt, "Tell me more.", 127);
    } else {
        strncpy(prompt, inputBuf, 127);
        inputBuf[0] = '\0';
        inputLen    = 0;
    }
    prompt[127] = '\0';
    moreMode = false;

    // Show user message and thinking indicator
    addMessage(true, false, prompt);
    showThinking();

    // Call API
    String response = callGemini(prompt);

    if (response.startsWith("ERR:")) {
        addMessage(false, true, response.c_str());
    } else {
        addMessage(false, false, response.c_str());
    }

    moreMode = true;   // after every reply, offer "More"
    drawInputBar();
}

void showModelChoices() {
    tft.setTextColor(TFT_WHITE, COL_BG);
    if (largeFont) {
        tft.setTextFont(2);
        tft.setCursor(0, 36); tft.print("1  Gemini 2.5 Flash");
        tft.setCursor(0, 54); tft.print("2  Gemini 3 Flash");
        tft.setCursor(0, 72); tft.print("3  Gemini 3 Pro");
        tft.setTextFont(1);
    } else {
        tft.setTextSize(1);
        tft.setCursor(0, 30); tft.print("Hit 1 for Gemini 2.5 Flash");
        tft.setCursor(0, 40); tft.print("    2 for Gemini 3 Flash");
        tft.setCursor(0, 50); tft.print("    3 for Gemini 3 Pro");
        tft.setCursor(0, 60); tft.print("    9 for large text");
    }
}

void selectModel() {
    static const char* modelIds[]    = {
        "gemini-2.5-flash",
        "gemini-3-flash-preview",
        "gemini-3.1-pro-preview"
    };
    static const bool  modelGlobal[] = { true, true, false };

    showModelChoices();

    while (true) {
        if (!ts.touched()) continue;
        TS_Point pt = ts.getPoint();
        while (ts.touched()) delay(5);
        int sx, sy;
        mapTouch(pt, sx, sy);

        // Hit-test keys 1, 2, 3 (first three of number row)
        int x = KB_ROW3_X;
        for (int i = 0; i < 3; i++, x += KEY_W + KEY_GAP) {
            if (inRect(sx, sy, x, KB_Y, KEY_W, KEY_H)) {
                char lbl[2] = { char('1' + i), '\0' };
                drawKey(x, KB_Y, KEY_W, KEY_H, lbl, TFT_WHITE, COL_BG);
                delay(100);
                drawKey(x, KB_Y, KEY_W, KEY_H, lbl, COL_KEY_FACE, COL_KEY_LABEL);
                strncpy(GEMINI_MODEL, modelIds[i], 47);
                GEMINI_MODEL[47] = '\0';
                geminiUseGlobal  = modelGlobal[i];
                // Confirm selection on screen
                tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, COL_BG);
                if (largeFont) {
                    tft.setTextFont(2);
                    tft.setTextColor(TFT_GREEN, COL_BG);
                    tft.setCursor(0,  0); tft.print("AI Terminal");
                    tft.setCursor(0, 18); tft.print(GEMINI_MODEL);
                    tft.setTextColor(TFT_DARKGREY, COL_BG);
                    tft.setCursor(0, 36); tft.print("Ready.");
                    tft.setTextFont(1);
                } else {
                    tft.setTextSize(1);
                    tft.setTextColor(TFT_GREEN, COL_BG);
                    tft.setCursor(0,  0); tft.print("AI Terminal. Swipe down for older chat.");
                    tft.setCursor(0, 10); tft.print("Model: "); tft.print(GEMINI_MODEL);
                    tft.setTextColor(TFT_DARKGREY, COL_BG);
                    tft.setCursor(0, 20); tft.print("Ready.");
                }
                return;
            }
        }

