alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
        // Key 9 (index 8 in number row) — toggle large text, re-show choices
        if (!largeFont) {
            int x9 = KB_ROW3_X + 8 * (KEY_W + KEY_GAP);
            if (inRect(sx, sy, x9, KB_Y, KEY_W, KEY_H)) {
                drawKey(x9, KB_Y, KEY_W, KEY_H, "9", TFT_WHITE, COL_BG);
                delay(100);
                drawKey(x9, KB_Y, KEY_W, KEY_H, "9", COL_KEY_FACE, COL_KEY_LABEL);
                largeFont = true;
                tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, COL_BG);
                tft.setTextFont(2);
                tft.setTextColor(TFT_DARKGREY, COL_BG);
                tft.setCursor(0,  0); tft.print("AI Terminal. Large text.");
                tft.setCursor(0, 18); tft.print("Select AI model:");
                tft.setTextFont(1);
                showModelChoices();  // re-show 1/2/3 in Font 2, without 9
            }
        }
    }
}

void setup() {
    Serial.begin(115200);

    // Display (init before backlight to avoid white flash)
    tft.init();
    tft.setRotation(1);
    tft.fillScreen(COL_BG);

    // Backlight on after screen is ready
    pinMode(TFT_BL, OUTPUT);
    digitalWrite(TFT_BL, HIGH);

    // Touch
    touchSPI.begin(TOUCH_SCLK, TOUCH_MISO, TOUCH_MOSI, TOUCH_CS_PIN);
    ts.begin(touchSPI);
    ts.setRotation(1);

    // Drain spurious startup touch
    unsigned long t0 = millis();
    while (ts.touched() && millis() - t0 < 500) delay(10);

    drawKeyboard();
    drawInputBar();
    connectWiFi();

    // Startup help — drawn directly in history area; cleared on first chat message
    tft.setTextSize(1);
    tft.setTextColor(TFT_DARKGREY, COL_BG);
    tft.setCursor(0,  0); tft.print("AI Terminal. Swipe down for older chat.");
    tft.setCursor(0, 10); tft.print("Ready. Select AI model:");

    selectModel();  // draws choices at y=30+ and waits for 1/2/3
}

void checkWiFiHealth() {
    if (millis() - lastWiFiCheckMs < 10000) return;
    lastWiFiCheckMs = millis();

    bool ok = (WiFi.status() == WL_CONNECTED) && Ping.ping(IPAddress(8,8,8,8), 1);

    if (ok != wifiHealthy) {
        wifiHealthy = ok;
        drawInputBar();  // '>' turns red on fail, white on recovery
    }

    if (!ok) {
        // Reconnect in background — status checked on next 10s tick
        WiFi.disconnect(false);
        WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
    }
}

void loop() {
    handleTouch();
    checkWiFiHealth();
}
